Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/atdf/PIC32CX1012BZ25032.atdf
<?xml version="1.0"?>
<!--
Copyright (c) 2017 Microchip Technology Inc.

SPDX-License-Identifier: Apache-2.0

Licensed under the Apache License, Version 2.0 (the "License"); you may
not use this file except in compliance with the License.
You may obtain a copy of the Licence at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an AS IS BASIS, WITHOUT
WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.

-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2020-07-31T00:50:54Z"/>
  <variants>
    <variant ordercode="PIC32CX1012BZ25032" package="QFN32" pinout="QFN32" speedmax="64000000" tempmin="-40" tempmax="105" vccmin="1.90" vccmax="3.60"/>
  </variants>
  <devices>
    <device name="PIC32CX1012BZ25032" architecture="CORTEX-M4" family="PIC32CX" series="BZ25">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="CMCC" start="0x03000000" size="0x1000000" type="io" rw="RW"/>
          <memory-segment name="CMCC_DATARAM" start="0x3000000" size="0x1000" type="io" rw="RW"/>
          <memory-segment name="CMCC_TAGRAM" start="0x3001000" size="0x400" type="io" rw="RW"/>
          <memory-segment name="CMCC_VALIDRAM" start="0x3002000" size="0x40" type="io" rw="RW"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x20000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HSRAM_ETB" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HSRAM_RET1" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="PBA" start="0x40000000" size="0x1000000" type="io" rw="RW"/>
          <memory-segment name="PBB" start="0x41000000" size="0x1000000" type="io" rw="RW"/>
          <memory-segment name="PBC" start="0x42000000" size="0x1000000" type="io" rw="RW"/>
          <memory-segment name="PB_PIC" start="0x44000000" size="0x20000" type="io" rw="RW"/>
          <memory-segment name="BKUPRAM" start="0x44014000" size="0x2000" type="ram" rw="RW"/>
          <memory-segment name="FLASH" start="0x01000000" size="0x100000" type="flash" pagesize="4096" rw="RW" exec="true"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
          <memory-segment name="QSPI" start="0x04000000" size="0x1000000" type="other" rw="RW" exec="true" external="true"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          <memory-segment name="BOOT_FLASH" start="0x00000000" size="0x5E00" type="flash" rw="RW" exec="true"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x20000000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="NUM_IRQ" value="40"/>
        <param name="__CM4_REV" value="0x0001"/>
        <param name="__DEBUG_LVL" value="3"/>
        <param name="__FPU_PRESENT" value="1"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__NVIC_PRIO_BITS" value="3"/>
        <param name="__TRACE_LVL" value="2"/>
        <param name="__VTOR_PRESENT" value="1"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
        <param caption="ARM architecture or not" name="__ARCH_ARM" value="1"/>
        <param caption="Primary Oscillator Input Default Frequency" name="__POSC_DEF_FREQ" value="16000000"/>
        <param caption="RFPLL Default Frequency" name="__RFPLL_DEF_FREQ" value="96000000"/>
        <param caption="Secondary Oscillator Input Default Frequency" name="__SOSC_DEF_FREQ" value="32768"/>
        <param caption="System Clock Default Frequency" name="__SYS_DEF_FREQ" value="64000000"/>
        <param caption="FRC Default Frequency" name="__FRC_DEF_FREQ" value="8000000"/>
        <param caption="REFCLKI Pin Input Default Frequency" name="__REFCLKI_DEF_FREQ" value="8000000"/>
        <param caption="Peripheral Bus 1 Default Clock Frequency" name="__PB1_DEF_FREQ" value="64000000"/>
        <param caption="Peripheral Bus 2 Default Clock Frequency" name="__PB2_DEF_FREQ" value="64000000"/>
        <param caption="Peripheral Bus 3 Default Clock Frequency" name="__PB3_DEF_FREQ" value="6400000"/>
        <param caption="Reference Clock 1 Default Frequency" name="__REFCLK1_DEF_FREQ" value="64000000"/>
        <param caption="Reference Clock 2 Default Frequency" name="__REFCLK2_DEF_FREQ" value="64000000"/>
        <param caption="Reference Clock 3 Default Frequency" name="__REFCLK3_DEF_FREQ" value="64000000"/>
        <param caption="Reference Clock 4 Default Frequency" name="__REFCLK4_DEF_FREQ" value="64000000"/>
        <param caption="Reference Clock 5 Default Frequency" name="__REFCLK5_DEF_FREQ" value="64000000"/>
        <param caption="Reference Clock 6 Default Frequency" name="__REFCLK6_DEF_FREQ" value="64000000"/>
        <param caption="Number of DMA Channels" name="__NUM_DMA_CHANNELS" value="16"/>
      </parameters>
      <peripherals>
        <module name="ADCHS" id="02508" version="1.0">
          <instance name="ADCHS">
            <register-group name="ADCHS" name-in-module="ADCHS" address-space="base" offset="0x44001400"/>
            <signals>
              <signal group="AIN" index="0" pad="PB04"/>
              <signal group="AIN" index="1" pad="PB05"/>
              <signal group="AIN" index="2" pad="PB06"/>
              <signal group="AIN" index="3" pad="PB07"/>
              <signal group="AIN" index="4" pad="PB00"/>
              <signal group="AIN" index="5" pad="PB01"/>
              <signal group="AIN" index="6" pad="PB02"/>
              <signal group="AIN" index="7" pad="PB03"/>
              <signal group="ANN" index="0" pad="PB06"/>
            </signals>
            <parameters>
              <param name="AIN" value="8" caption="BandGap Reference (internal AN8)"/>
              <param name="AIN" value="9" caption="IVref 1.2V (internal AN9)"/>
              <param name="AIN" value="10" caption="VBAT/2 (internal AN10)"/>
              <param name="AIN" value="11" caption="CTMU Temperature Sensor (internal AN11)"/>
            </parameters>
          </instance>
        </module>
        <module name="AES" id="U2238" version="2.2.0">
          <instance name="AES">
            <register-group name="AES" name-in-module="AES" address-space="base" offset="0x42000400"/>
            <parameters>
              <param name="DMAC_ID_RD" value="42" caption="DMA DATA Read trigger"/>
              <param name="DMAC_ID_WR" value="41" caption="DMA DATA Write trigger"/>
              <param name="FOUR_BYTE_OPERATION" value="1" caption="Byte Operation"/>
              <param name="GCM" value="1" caption="GCM"/>
              <param name="KEYLEN" value="2" caption="Key Length"/>
              <param name="INSTANCE_ID" value="65"/>
            </parameters>
          </instance>
        </module>
        <module name="BLE" id="U6667" version="1.0">
          <instance name="BLE">
            <register-group name="BLE" name-in-module="BLE" address-space="base" offset="0x41012000"/>
