Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/atdf/PIC32CX1012BZ25032.atdf
          </instance>
        </module>
        <module name="BTZBSYS" id="U9998" version="1.0.0">
          <instance name="BTZBSYS">
            <register-group name="BTZBSYS" name-in-module="BTZBSYS" address-space="base" offset="0x41014000"/>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="1.1.0">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="IN" index="0" function="1" pad="PA03" ioset="1"/>
              <signal group="IN" index="0" function="2" pad="PA07" ioset="1"/>
              <signal group="IN" index="0" function="3" pad="PA11" ioset="1"/>
              <signal group="IN" index="0" function="4" pad="PB00" ioset="1"/>
              <signal group="IN" index="0" function="5" pad="PB04" ioset="1"/>
              <signal group="IN" index="0" function="6" pad="PB08" ioset="1"/>
              <signal group="IN" index="0" function="7" pad="PB12" ioset="1"/>
              <signal group="IN" index="0" function="8" pad="PA02" ioset="1"/>
              <signal group="IN" index="0" function="9" pad="PA06" ioset="1"/>
              <signal group="IN" index="0" function="10" pad="PA10" ioset="1"/>
              <signal group="IN" index="0" function="11" pad="PA14" ioset="1"/>
              <signal group="IN" index="0" function="12" pad="PB03" ioset="1"/>
              <signal group="IN" index="0" function="13" pad="PB07" ioset="1"/>
              <signal group="IN" index="0" function="14" pad="PB11" ioset="1"/>
              <signal group="IN" index="0" function="15" pad="PA09" ioset="1"/>
              <signal group="IN" index="1" function="1" pad="PA04" ioset="2"/>
              <signal group="IN" index="1" function="2" pad="PA08" ioset="2"/>
              <signal group="IN" index="1" function="3" pad="PA12" ioset="2"/>
              <signal group="IN" index="1" function="4" pad="PB01" ioset="2"/>
              <signal group="IN" index="1" function="5" pad="PB05" ioset="2"/>
              <signal group="IN" index="1" function="6" pad="PB09" ioset="2"/>
              <signal group="IN" index="1" function="7" pad="PB13" ioset="2"/>
              <signal group="IN" index="1" function="8" pad="PA03" ioset="2"/>
              <signal group="IN" index="1" function="9" pad="PA07" ioset="2"/>
              <signal group="IN" index="1" function="10" pad="PA11" ioset="2"/>
              <signal group="IN" index="1" function="11" pad="PB00" ioset="2"/>
              <signal group="IN" index="1" function="12" pad="PB04" ioset="2"/>
              <signal group="IN" index="1" function="13" pad="PB08" ioset="2"/>
              <signal group="IN" index="1" function="14" pad="PB12" ioset="2"/>
              <signal group="IN" index="1" function="15" pad="PA00" ioset="2"/>
              <signal group="IN" index="2" function="1" pad="PA05" ioset="3"/>
              <signal group="IN" index="2" function="2" pad="PA09" ioset="3"/>
              <signal group="IN" index="2" function="3" pad="PA13" ioset="3"/>
              <signal group="IN" index="2" function="4" pad="PB02" ioset="3"/>
              <signal group="IN" index="2" function="5" pad="PB06" ioset="3"/>
              <signal group="IN" index="2" function="6" pad="PB10" ioset="3"/>
              <signal group="IN" index="2" function="7" pad="PA00" ioset="3"/>
              <signal group="IN" index="2" function="8" pad="PA04" ioset="3"/>
              <signal group="IN" index="2" function="9" pad="PA08" ioset="3"/>
              <signal group="IN" index="2" function="10" pad="PA12" ioset="3"/>
              <signal group="IN" index="2" function="11" pad="PB01" ioset="3"/>
              <signal group="IN" index="2" function="12" pad="PB05" ioset="3"/>
              <signal group="IN" index="2" function="13" pad="PB09" ioset="3"/>
              <signal group="IN" index="2" function="14" pad="PB13" ioset="3"/>
              <signal group="IN" index="2" function="15" pad="PA01" ioset="3"/>
              <signal group="IN" index="3" function="1" pad="PA03" ioset="1"/>
              <signal group="IN" index="3" function="2" pad="PA07" ioset="1"/>
              <signal group="IN" index="3" function="3" pad="PA11" ioset="1"/>
              <signal group="IN" index="3" function="4" pad="PB00" ioset="1"/>
              <signal group="IN" index="3" function="5" pad="PB04" ioset="1"/>
              <signal group="IN" index="3" function="6" pad="PB08" ioset="1"/>
              <signal group="IN" index="3" function="7" pad="PB12" ioset="1"/>
              <signal group="IN" index="3" function="8" pad="PA02" ioset="1"/>
              <signal group="IN" index="3" function="9" pad="PA06" ioset="1"/>
              <signal group="IN" index="3" function="10" pad="PA10" ioset="1"/>
              <signal group="IN" index="3" function="11" pad="PA14" ioset="1"/>
              <signal group="IN" index="3" function="12" pad="PB03" ioset="1"/>
              <signal group="IN" index="3" function="13" pad="PB07" ioset="1"/>
              <signal group="IN" index="3" function="14" pad="PB11" ioset="1"/>
              <signal group="IN" index="3" function="15" pad="PA09" ioset="1"/>
              <signal group="IN" index="4" function="1" pad="PA04" ioset="2"/>
              <signal group="IN" index="4" function="2" pad="PA08" ioset="2"/>
              <signal group="IN" index="4" function="3" pad="PA12" ioset="2"/>
              <signal group="IN" index="4" function="4" pad="PB01" ioset="2"/>
              <signal group="IN" index="4" function="5" pad="PB05" ioset="2"/>
              <signal group="IN" index="4" function="6" pad="PB09" ioset="2"/>
              <signal group="IN" index="4" function="7" pad="PB13" ioset="2"/>
              <signal group="IN" index="4" function="8" pad="PA03" ioset="2"/>
              <signal group="IN" index="4" function="9" pad="PA07" ioset="2"/>
              <signal group="IN" index="4" function="10" pad="PA11" ioset="2"/>
              <signal group="IN" index="4" function="11" pad="PB00" ioset="2"/>
              <signal group="IN" index="4" function="12" pad="PB04" ioset="2"/>
              <signal group="IN" index="4" function="13" pad="PB08" ioset="2"/>
              <signal group="IN" index="4" function="14" pad="PB12" ioset="2"/>
              <signal group="IN" index="4" function="15" pad="PA00" ioset="2"/>
              <signal group="IN" index="5" function="1" pad="PA05" ioset="3"/>
              <signal group="IN" index="5" function="2" pad="PA09" ioset="3"/>
              <signal group="IN" index="5" function="3" pad="PA13" ioset="3"/>
              <signal group="IN" index="5" function="4" pad="PB02" ioset="3"/>
              <signal group="IN" index="5" function="5" pad="PB06" ioset="3"/>
              <signal group="IN" index="5" function="6" pad="PB10" ioset="3"/>
              <signal group="IN" index="5" function="7" pad="PA00" ioset="3"/>
              <signal group="IN" index="5" function="8" pad="PA04" ioset="3"/>
              <signal group="IN" index="5" function="9" pad="PA08" ioset="3"/>
              <signal group="IN" index="5" function="10" pad="PA12" ioset="3"/>
              <signal group="IN" index="5" function="11" pad="PB01" ioset="3"/>
              <signal group="IN" index="5" function="12" pad="PB05" ioset="3"/>
              <signal group="IN" index="5" function="13" pad="PB09" ioset="3"/>
              <signal group="IN" index="5" function="14" pad="PB13" ioset="3"/>
              <signal group="IN" index="5" function="15" pad="PA01" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PA00" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PA01" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PA03" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PA04" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PA05" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PA08" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PA09" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PA13" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PB01" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PB02" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PB05" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PB06" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PB09" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PB10" ioset="3"/>
              <signal group="OUT" index="0" function="28" pad="PB13" ioset="3"/>
              <signal group="OUT" index="1" function="28" pad="PA01" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PA02" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PA04" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PA05" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PA06" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PA08" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PA09" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PA10" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PA13" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PA14" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PB02" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PB03" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PB06" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PB07" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PB10" ioset="4"/>
              <signal group="OUT" index="1" function="28" pad="PB11" ioset="4"/>
            </signals>
            <parameters>
              <param name="LUT_NUM" value="2"/>
              <param name="SEQ_NUM" value="2"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
        </module>
        <module name="CFG" id="U500" version="1.0">
          <instance name="CFG">
            <register-group name="CFG" name-in-module="CFG" address-space="base" offset="0x44000000"/>
