Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/atdf/PIC32CX1012BZ25032.atdf
      <value-group caption="ADC Module Enable bit" name="ADCCON1__ON">
        <value caption="ADC module is enabled" name="ENABLED" value="0x1"/>
        <value caption="ADC module is disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="Scan Trigger Source Select bits" name="ADCCON1__STRGSRC">
        <value caption="External trigger for validation" name="EXT_TRIG_VAL" value="0x1f"/>
        <value caption="ADC_TRIG_16" name="EVSYS_47" value="0x10"/>
        <value caption="ADC_TRIG_15" name="EVSYS_46" value="0xf"/>
        <value caption="ADC_TRIG_14" name="EVSYS_45" value="0xe"/>
        <value caption="ADC_TRIG_13" name="EVSYS_44" value="0xd"/>
        <value caption="ADC_TRIG_12" name="EVSYS_43" value="0xc"/>
        <value caption="ADC_TRIG_11" name="EVSYS_42" value="0xb"/>
        <value caption="ADC_TRIG_10" name="EVSYS_41" value="0xa"/>
        <value caption="ADC_TRIG_9" name="EVSYS_40" value="0x9"/>
        <value caption="ADC_TRIG_8" name="EVSYS_39" value="0x8"/>
        <value caption="ADC_TRIG_7" name="EVSYS_38" value="0x7"/>
        <value caption="ADC_TRIG_6" name="EVSYS_37" value="0x6"/>
        <value caption="ADC_TRIG_5" name="EVSYS_36" value="0x5"/>
        <value caption="INT0" name="INT0" value="0x4"/>
        <value caption="RESERVED" name="RESERVED" value="0x3"/>
        <value caption="Software level trigger" name="SW_LVL" value="0x2"/>
        <value caption="Software edge trigger" name="SW_EDGE" value="0x1"/>
        <value caption="No Trigger" name="NONE" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC7 Resolution bits" name="ADCCON1__SELRES">
        <value caption="12 bits (default)" name="12_BITS" value="0x3"/>
        <value caption="10 bits" name="10_BITS" value="0x2"/>
        <value caption="8 bits" name="8_BITS" value="0x1"/>
        <value caption="6 bits" name="6_BITS" value="0x0"/>
      </value-group>
      <value-group caption="Fractional Data Output Format bit" name="ADCCON1__FRACT">
        <value caption="Fractional" name="FRAC" value="0x1"/>
        <value caption="Integer" name="INT" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Early Interrupt Select bits" name="ADCCON2__ADCEIS">
        <value caption="The data ready interrupt is generated 8 ADC clocks prior to end of conversion" name="8CLKS_EARLY" value="0x7"/>
        <value caption="The data ready interrupt is generated 7 ADC clocks prior to end of conversion" name="7CLKS_EARLY" value="0x6"/>
        <value caption="The data ready interrupt is generated 6 ADC clocks prior to end of conversion" name="6CLKS_EARLY" value="0x5"/>
        <value caption="The data ready interrupt is generated 5 ADC clocks prior to end of conversion" name="5CLKS_EARLY" value="0x4"/>
        <value caption="The data ready interrupt is generated 4 ADC clocks prior to end of conversion" name="4CLKS_EARLY" value="0x3"/>
        <value caption="The data ready interrupt is generated 3 ADC clocks prior to end of conversion" name="3CLKS_EARLY" value="0x2"/>
        <value caption="The data ready interrupt is generated 2 ADC module clocks prior to end of conversion" name="2CLKS_EARLY" value="0x1"/>
        <value caption="The data ready interrupt is generated 1 ADC module clock prior to end of conversion" name="1CLKS_EARLY" value="0x0"/>
      </value-group>
      <value-group caption="End of Scan Interrupt Enable bit" name="ADCCON2__EOSIEN">
        <value caption="Interrupt will be generated when EOSRDY bit is set" name="EOSRDY_INT" value="0x1"/>
        <value caption="No interrupt is generated when the EOSRDY bit is set" name="NOEOSRDY_INT" value="0x0"/>
      </value-group>
      <value-group caption="Band Gap/ Vref Voltage Fault Interrupt Enable bit" name="ADCCON2__REFFLTIEN">
        <value caption="Interrupt will be generated when the REFFLT bit is set" name="REFFLT_INT" value="0x1"/>
        <value caption="No interrupt is generated when the REFFLT bit is set" name="NOREFFLT_INT" value="0x0"/>
      </value-group>
      <value-group caption="Band Gap/ Vref Voltage Ready Interrupt Enable bit" name="ADCCON2__BGVRIEN">
        <value caption="Interrupt will be generated when the BGVRDDY bit is set" name="BGVRDDY_INT" value="0x1"/>
        <value caption="No interrupt is generated when the BGVRRDY bit is set" name="NOBGVRDDY_INT" value="0x0"/>
      </value-group>
      <value-group caption="End of Scan Interrupt Status bit" name="ADCCON2__EOSRDY">
        <value caption="All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning" name="SCAN_COMPLETE" value="0x1"/>
        <value caption="Scanning has not completed" name="SCAN_NOT_COMPLETE" value="0x0"/>
      </value-group>
      <value-group caption="Band Gap/ Vref / AVdd BOR Fault Status bit" name="ADCCON2__REFFLT">
        <value caption="Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap or Vref fault will be caused by a BOR of the analog Vdd supply." name="BG_VREF_FLT" value="0x1"/>
        <value caption="Band gap and Vref voltage are working properly" name="BG_VREF_OK" value="0x0"/>
      </value-group>
      <value-group caption="Band Gap Voltage/ADC Reference Voltage Status bit" name="ADCCON2__BGVRRDY">
        <value caption="Both band gap voltage and ADC reference voltages (Vref) are ready" name="VREF_RDY" value="0x1"/>
        <value caption="Either or both band gap voltage and ADC reference voltages (Vref) are not ready" name="VREF_NOTRDY" value="0x0"/>
      </value-group>
      <value-group caption="Analog Input Select bits" name="ADCCON3__ADINSEL">
        <value caption="CTMU Temperature Sensor (internal AN11)" name="TMP_SENSE" value="0x0B"/>
        <value caption="VBAT/2 (internal AN10)" name="VBATDIV2_SENSE" value="0x0A"/>
        <value caption="IVref 1.2V (internal AN9)" name="1P2V_SENSE" value="0x9"/>
        <value caption="BandGap Reference (internal AN8)" name="BGREF" value="0x8"/>
        <value caption="AN7" name="AN7" value="0x7"/>
        <value caption="AN6" name="AN6" value="0x6"/>
        <value caption="AN5" name="AN5" value="0x5"/>
        <value caption="AN4" name="AN4" value="0x4"/>
        <value caption="AN3" name="AN3" value="0x3"/>
        <value caption="AN2" name="AN2" value="0x2"/>
        <value caption="AN1" name="AN1" value="0x1"/>
        <value caption="AN0" name="AN0" value="0x0"/>
      </value-group>
