Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/atdf/PIC32CX1012BZ25032.atdf
        <register caption="" name="RNMICONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x54"> </register>
        <register caption="" name="RNMICONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x58"> </register>
        <register caption="" name="RNMICONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x5C"> </register>
      </register-group>
      <value-group caption="Power-On Reset Flag bit" name="RCON__POR">
        <value caption="A Power-up Reset has occurred." name="POR" value="0x1"/>
        <value caption="A Power-up Reset has not occurred." name="NO_POR" value="0x0"/>
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
        <value caption="A Brown-out Reset has occurred." name="BOR" value="0x1"/>
        <value caption="A Brown-out Reset has not occurred." name="NO_BOR" value="0x0"/>
      </value-group>
      <value-group caption="Wake from Idle Flag bit" name="RCON__IDLE">
        <value caption="Device was in Idle mode." name="IDLE" value="0x1"/>
        <value caption="Device was not in Idle mode." name="NOT_IDLE" value="0x0"/>
      </value-group>
      <value-group caption="Wake from Sleep Flag bit" name="RCON__SLEEP">
        <value caption="Device has been in Sleep mode." name="SLEEP" value="0x1"/>
        <value caption="Device has not been in Sleep mode." name="NOT_SLEEP" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Time-Out Flag bit" name="RCON__WDTO">
        <value caption="WDT Time-out has occurred and caused a reset." name="WDTO" value="0x1"/>
        <value caption="WDT Time-out has not occurred." name="NOT_WDTO" value="0x0"/>
      </value-group>
      <value-group caption="Deadman Timer Time-Out Flag bit" name="RCON__DMTO">
        <value caption="DMT Time-out has occurred and caused a reset." name="DMTO" value="0x1"/>
        <value caption="DMT Time-out has not occurred." name="NOT_DMTO" value="0x0"/>
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
        <value caption="A Software Commanded Reset has occurred." name="SWR" value="0x1"/>
        <value caption="A Software Commanded Reset has not occurred." name="NOT_SWR" value="0x0"/>
      </value-group>
      <value-group caption="External Reset (MCLR) Status bit" name="RCON__EXTR">
        <value caption="A Master Clear (pin) Reset has occurred." name="EXTR" value="0x1"/>
        <value caption="A Master Clear (pin) Reset has not occurred." name="NOT_EXTR" value="0x0"/>
      </value-group>
      <value-group caption="Configuration Mismatch Flag bit" name="RCON__CMR">
        <value caption="A Configuration Mismatch Reset Event has occurred." name="CMR" value="0x1"/>
        <value caption="A Configuration Mismatch Reset Event has not occurred." name="NOT_CMR" value="0x0"/>
      </value-group>
      <value-group caption="DPSLP Deep Sleep Mode Flag Bit" name="RCON__DPSLP">
        <value caption="Deep Sleep Mode has occurred." name="DSLP" value="0x1"/>
        <value caption="Deep Sleep Mode has not occurred." name="NOT_DSLP" value="0x0"/>
      </value-group>
      <value-group caption="NVM End of Life Flag Bit" name="RCON__NVMEOL">
        <value caption="A NVM EOL Failure has not occurred." name="NO_NVMEOL" value="0x0"/>
        <value caption="A NVM EOL Failure has occurred." name="NVMEOL" value="0x1"/>
      </value-group>
      <value-group caption="NVM Life Time Alert Flag Bit" name="RCON__NVMLTA">
        <value caption="A NVM LTA Error has not occurred." name="NO_NVMLTA" value="0x0"/>
        <value caption="A NVM LTA Error has occurred." name="NVMLTA" value="0x1"/>
      </value-group>
      <value-group caption="BCFG Failure Flag Bit" name="RCON__BCFGFAIL">
        <value caption="A BCFG Failure has not occurred." name="NO_BCFGFAIL" value="0x0"/>
        <value caption="A BCFG Failure has occurred." name="BCFGFAIL" value="0x1"/>
      </value-group>
      <value-group caption="BCFG Error Flag Bit" name="RCON__BCFGERR">
        <value caption="A BCFG Error has not occurred." name="NO_BCFGERR" value="0x0"/>
        <value caption="A BCFG Error has occurred." name="BCFGERR" value="0x1"/>
      </value-group>
      <value-group caption="Core Voltage POR Flag bit" name="RCON__PORCORE">
        <value caption="A Power-up Reset has occurred due to Core Voltage." name="PORCORE" value="0x1"/>
        <value caption="A Power-up Reset has not occurred due to Core Voltage." name="NO_PORCORE" value="0x0"/>
      </value-group>
      <value-group caption="IO Voltage POR Flag bit" name="RCON__PORIO">
        <value caption="A Power-up Reset has occurred due to IO Voltage." name="PORIO" value="0x1"/>
        <value caption="A Power-up Reset has not occurred due to IO Voltage." name="NO_PORIO" value="0x0"/>
      </value-group>
      <value-group caption="Software Reset Trigger" name="RSWRST__SWRST">
        <value caption="Enable software reset event" name="SWRST" value="0x1"/>
        <value caption="Do not enable software reset event" name="NO_SWRST" value="0x0"/>
      </value-group>
      <value-group caption="NMI Reset counter value" name="RNMICON__NMICNT">
        <value caption="No delay between NMI assertion and device reset event" name="NODLY" value="0x0"/>
        <value caption="1 sys_clk cycle that Software has to clear the NMI event before a device reset is performed." name="1CLKDLY" value="0x1"/>
        <value caption="2 sys_clk cycles that Software has to clear the NMI event before a device reset is performed." name="2CLKDLY" value="0x2"/>
        <value caption="65535 sys_clk cycles that Software has to clear the NMI event before a device reset is performed." name="64KCLKDLY" value="0xffff"/>
      </value-group>
      <value-group caption="Watch-Dog Timer Time-Out in Sleep Flag bit" name="RNMICON__WDTS">
        <value caption="WDT Time-out has occurred during sleep_mode and caused a wake-up from sleep." name="WDTS" value="0x1"/>
        <value caption="WDT Time-out has not occurred during sleep_mode." name="NO_WDTS" value="0x0"/>
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
        <value caption="FSCM has detected clock failure and caused an NMI" name="CFAIL" value="0x1"/>
        <value caption="FSCM has not detected clock failure" name="NO_FAILDET" value="0x0"/>
      </value-group>
      <value-group caption="Programmable Low Voltage Detect Event" name="RNMICON__LVD">
        <value caption="PLVD has detected a low voltage condition and caused an NMI" name="LVD" value="0x1"/>
        <value caption="PLVD has not detected a low voltage condition" name="NO_LVD" value="0x0"/>
      </value-group>
      <value-group caption="External / Generic NMI Event" name="RNMICON__GNMI">
        <value caption="A general NMI event has been detected and caused an NMI" name="NMI" value="0x1"/>
        <value caption="A general NMI event has not been detected." name="NO_NMI" value="0x0"/>
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
        <value caption="Writing a 1 to this bit will cause an NMI to be generated" name="SWNMI" value="0x1"/>
        <value caption="Writing a 0 to this bit will have no effect." name="NO_SWNMI" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Time-Out in Run Flag bit" name="RNMICON__WDTR">
        <value caption="WDT Time-out has occurred and caused a NMI." name="WDTR" value="0x1"/>
        <value caption="WDT Time-out has not occurred." name="NO_WDTR" value="0x0"/>
      </value-group>
      <value-group caption="Deadman Timer Time-Out Flag bit" name="RNMICON__DMTO">
        <value caption="DMT Time-out has occurred and caused a NMI." name="DMTO" value="0x1"/>
        <value caption="DMT Time-out has not occurred." name="NO_DMTO" value="0x0"/>
      </value-group>
    </module>
    <module name="DMAC" id="U2503" version="1.0.1" caption="Direct Memory Access Controller">
      <register-group name="CHANNEL" size="0x10">
        <register name="CHCTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Channel n Control A">
          <bitfield name="SWRST" caption="Channel Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Channel Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Channel Run in Standby" mask="0x40"/>
          <bitfield name="TRIGSRC" caption="Trigger Source" mask="0x7F00" values="DMAC_CHCTRLA__TRIGSRC"/>
          <bitfield name="TRIGACT" caption="Trigger Action" mask="0x300000" values="DMAC_CHCTRLA__TRIGACT"/>
          <bitfield name="BURSTLEN" caption="Burst Length" mask="0xF000000" values="DMAC_CHCTRLA__BURSTLEN"/>
          <bitfield name="THRESHOLD" caption="FIFO Threshold" mask="0x30000000" values="DMAC_CHCTRLA__THRESHOLD"/>
        </register>
        <register name="CHCTRLB" offset="0x4" rw="RW" size="1" initval="0x00" caption="Channel n Control B">
          <bitfield name="CMD" caption="Software Command" mask="0x3" values="DMAC_CHCTRLB__CMD"/>
        </register>
        <register name="CHPRILVL" offset="0x5" rw="RW" size="1" initval="0x00" caption="Channel n Priority Level">
          <bitfield name="PRILVL" caption="Channel Priority Level" mask="0x3" values="DMAC_CHPRILVL__PRILVL"/>
        </register>
