Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/atdf/PIC32CX1012BZ25032.atdf
        <register name="NVMCONCLR" offset="0x04" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMCONSET" offset="0x08" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMCONINV" offset="0x0C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMCON2" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PREPG" caption="" mask="0x1"/>
          <bitfield name="SWAPLK" caption="" mask="0xc0"/>
          <bitfield name="RETRY" caption="" mask="0x300"/>
          <bitfield name="VREAD1" caption="" mask="0x1000"/>
          <bitfield name="CREAD1" caption="" mask="0x2000"/>
          <bitfield name="TEMP" caption="" mask="0x4000"/>
          <bitfield name="WS" caption="" mask="0x1f0000"/>
          <bitfield name="SLEEP" caption="" mask="0x1000000"/>
          <bitfield name="ERS" caption="" mask="0xf0000000"/>
        </register>
        <register name="NVMCON2CLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMCON2SET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMCON2INV" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMKEY" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMKEY" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMADDR" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMADDR" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMDATA0" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMDATA0" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMDATA1" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMDATA1" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMDATA2" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMDATA2" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMDATA3" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMDATA3" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMDATA4" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMDATA4" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMDATA5" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMDATA5" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMDATA6" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMDATA6" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMDATA7" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMDATA7" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMSRCADDR" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NVMSRCADDR" caption="" mask="0xffffffff"/>
        </register>
        <register name="NVMPWPLT" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PWPLT" caption="" mask="0xffffff"/>
          <bitfield name="ULOCK" caption="" mask="0x80000000"/>
        </register>
        <register name="NVMPWPLTCLR" offset="0xd4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMPWPLTSET" offset="0xd8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMPWPLTINV" offset="0xdC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMPWPGTE" offset="0xe0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PWPGTE" caption="" mask="0xffffff"/>
          <bitfield name="ULOCK" caption="" mask="0x80000000"/>
        </register>
        <register name="NVMPWPGTECLR" offset="0xe4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMPWPGTESET" offset="0xe8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMPWPGTEINV" offset="0xeC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMLBWP" offset="0xf0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="LBWP0" caption="" mask="0x1"/>
          <bitfield name="LBWP1" caption="" mask="0x2"/>
          <bitfield name="LBWP2" caption="" mask="0x4"/>
          <bitfield name="LBWP3" caption="" mask="0x8"/>
          <bitfield name="LBWP4" caption="" mask="0x10"/>
          <bitfield name="LBWP5" caption="" mask="0x20"/>
          <bitfield name="LBWP6" caption="" mask="0x40"/>
          <bitfield name="LBWP7" caption="" mask="0x80"/>
          <bitfield name="LBWP8" caption="" mask="0x100"/>
          <bitfield name="LBWP9" caption="" mask="0x200"/>
          <bitfield name="LBWP10" caption="" mask="0x400"/>
          <bitfield name="LBWP11" caption="" mask="0x800"/>
          <bitfield name="LBWP12" caption="" mask="0x1000"/>
          <bitfield name="LBWP13" caption="" mask="0x2000"/>
          <bitfield name="LBWP14" caption="" mask="0x4000"/>
          <bitfield name="LBWP15" caption="" mask="0x8000"/>
          <bitfield name="LBWP16" caption="" mask="0x10000"/>
          <bitfield name="LBWP17" caption="" mask="0x20000"/>
          <bitfield name="LBWP18" caption="" mask="0x40000"/>
          <bitfield name="LBWP19" caption="" mask="0x80000"/>
          <bitfield name="LBWP20" caption="" mask="0x100000"/>
          <bitfield name="LBWP21" caption="" mask="0x200000"/>
          <bitfield name="LBWP22" caption="" mask="0x400000"/>
          <bitfield name="LBWP23" caption="" mask="0x800000"/>
          <bitfield name="ULOCK" caption="" mask="0x80000000"/>
        </register>
        <register name="NVMLBWPCLR" offset="0xf4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMLBWPSET" offset="0xf8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMLBWPINV" offset="0xfC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
