Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/atdf/PIC32CX1012BZ25032.atdf
      <value-group name="DEVCFG0__SWOEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__TROEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__JTAGEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__ADCPOVR">
        <value name="HW" caption="" value="0x0"/>
        <value name="SW" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__GPSOSCE">
        <value name="GPIO" caption="" value="0x0"/>
        <value name="SOSC" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__ACCMP1_ALTEN">
        <value name="PA6" caption="" value="0x1"/>
        <value name="PA1" caption="" value="0x0"/>
      </value-group>
      <value-group name="DEVCFG0__CPENFILT">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__RTCIN0_ALTEN">
        <value name="PA3" caption="" value="0x0"/>
        <value name="PA9" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__RTCOUT_ALTEN">
        <value name="PA4" caption="" value="0x0"/>
        <value name="PA10" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__PMULOCK">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__PGLOCK">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__PMDLOCK">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__IOLOCK">
        <value name="UNLOCKED" caption="" value="0x0"/>
        <value name="LOCKED" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__CFGLOCK">
        <value name="NVR_NOT_LOCKED" caption="" value="0x0"/>
        <value name="RESERVED" caption="" value="0x1"/>
        <value name="NVR_LOCKED_CFGLOCK_UNLOCKED" caption="" value="0x2"/>
        <value name="NVR_LOCKED_CFGLOCK_LOCKED" caption="" value="0x3"/>
      </value-group>
      <value-group name="DEVCFG0__VBCMODE">
        <value name="DIRECT" caption="" value="0x0"/>
        <value name="INDIR" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SMBUSEN0">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SMBUSEN1">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SMBUSEN2">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__HPLUGDIS">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SLRTEN0">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SLRTEN1">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SLRTEN2">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__PCM">
        <value name="CPU" caption="" value="0x0"/>
        <value name="SFR" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__INT0E">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__INT0P">
        <value name="NEG" caption="" value="0x0"/>
        <value name="POS" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__FECCCON">
        <value name="ON" caption="" value="0x0"/>
        <value name="DYNAMIC" caption="" value="0x1"/>
        <value name="OFF" caption="" value="0x3"/>
      </value-group>
      <value-group name="DEVCFG0__FRECCDIS">
        <value name="OFF" caption="" value="0x1"/>
        <value name="ON" caption="" value="0x0"/>
      </value-group>
      <!-- DEVCFG1 STUFF -->
      <value-group name="DEVCFG1__ICESEL">
        <value name="PGC4_PGD4" caption="" value="0x0"/>
        <value name="NOT_USED" caption="" value="0x1"/>
        <value name="PGC2_PGD2" caption="" value="0x2"/>
        <value name="PGC1_PGD1" caption="" value="0x3"/>
      </value-group>
      <value-group name="DEVCFG1__TRCEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__ZBTWKSYS">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__CMP0_OE">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__CMP1_OE">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__CLASSBDIS">
        <value name="ON" caption="" value="0x0"/>
        <value name="OFF" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__SLRCTRL0">
        <value name="GPIO" caption="" value="0x0"/>
        <value name="SERCOM" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__SLRCTRL1">
        <value name="GPIO" caption="" value="0x0"/>
        <value name="SERCOM" caption="" value="0x1"/>
      </value-group>
