Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/atdf/PIC32CX1012BZ25032.atdf
      <value-group caption="Dead Man Timer Count Select bits" name="DEVCFG2__DMTCNT">
        <value caption="2^8 (256)" name="DMT8" value="0x0"/>
        <value caption="2^9 (512)" name="DMT9" value="0x1"/>
        <value caption="2^10 (1024)" name="DMT10" value="0x2"/>
        <value caption="2^11 (2048)" name="DMT11" value="0x3"/>
        <value caption="2^12 (4096)" name="DMT12" value="0x4"/>
        <value caption="2^13 (8192)" name="DMT13" value="0x5"/>
        <value caption="2^14 (16384)" name="DMT14" value="0x6"/>
        <value caption="2^15 (32768)" name="DMT15" value="0x7"/>
        <value caption="2^16 (65536)" name="DMT16" value="0x8"/>
        <value caption="2^17 (131072)" name="DMT17" value="0x9"/>
        <value caption="2^18 (262144)" name="DMT18" value="0xa"/>
        <value caption="2^19 (524288)" name="DMT19" value="0xb"/>
        <value caption="2^20 (1048576)" name="DMT20" value="0xc"/>
        <value caption="2^21 (2097152)" name="DMT21" value="0xd"/>
        <value caption="2^22 (4194304)" name="DMT22" value="0xe"/>
        <value caption="2^23 (8388608)" name="DMT23" value="0xf"/>
        <value caption="2^24 (16777216)" name="DMT24" value="0x10"/>
        <value caption="2^25 (33554432)" name="DMT25" value="0x11"/>
        <value caption="2^26 (67108864)" name="DMT26" value="0x12"/>
        <value caption="2^27 (134217728)" name="DMT27" value="0x13"/>
        <value caption="2^28 (268435456)" name="DMT28" value="0x14"/>
        <value caption="2^29 (536870912)" name="DMT29" value="0x15"/>
        <value caption="2^30 (1073741824)" name="DMT30" value="0x16"/>
        <value caption="2^31 (2147483648)" name="DMT31" value="0x17"/>
      </value-group>
      <!--DEVCFG4 STUFF -->
      <value-group caption="Deep Sleep Watchdog Timer Postscaler" name="DEVCFG4__DSWDTPS">
        <value caption="1:32(1ms)" name="DSPS5" value="0x0"/>
        <value caption="1:64(2.1ms)" name="DSPS6" value="0x1"/>
        <value caption="1:128(4.1ms)" name="DSPS7" value="0x2"/>
        <value caption="1:256(8.3ms)" name="DSPS8" value="0x3"/>
        <value caption="1:512(16.5ms)" name="DSPS9" value="0x4"/>
        <value caption="1:1024(33ms)" name="DSPS10" value="0x5"/>
        <value caption="1:2048(66.1ms)" name="DSPS11" value="0x6"/>
        <value caption="1:4096(132.1ms)" name="DSPS12" value="0x7"/>
        <value caption="1:8192(264.3ms)" name="DSPS13" value="0x8"/>
        <value caption="1:16384(528.5ms)" name="DSPS14" value="0x9"/>
        <value caption="1:32768(1.057s)" name="DSPS15" value="0xa"/>
        <value caption="1:65536(2.114s)" name="DSPS16" value="0xb"/>
        <value caption="1:2^17(4.288s)" name="DSPS17" value="0xc"/>
        <value caption="1:2^18(8.456s)" name="DSPS18" value="0xd"/>
        <value caption="1:2^19(16.912s)" name="DSPS19" value="0xe"/>
        <value caption="1:2^20(33.825s)" name="DSPS20" value="0xf"/>
        <value caption="1:2^21(67.7s)" name="DSPS21" value="0x10"/>
        <value caption="1:2^22(135.3s)" name="DSPS22" value="0x11"/>
        <value caption="1:2^23(4.5 minutes)" name="DSPS23" value="0x12"/>
        <value caption="1:2^24(9.0 minutes)" name="DSPS24" value="0x13"/>
        <value caption="1:2^25(18.0 minutes)" name="DSPS25" value="0x14"/>
        <value caption="1:2^26(36.1 minutes)" name="DSPS26" value="0x15"/>
        <value caption="1:2^27(72.2 minutes)" name="DSPS27" value="0x16"/>
        <value caption="1:2^28(2.4 hours)" name="DSPS28" value="0x17"/>
        <value caption="1:2^29(4.8 hours)" name="DSPS29" value="0x18"/>
        <value caption="1:2^30(9.6 hours)" name="DSPS30" value="0x19"/>
        <value caption="1:2^31(19.2 hours)" name="DSPS31" value="0x1a"/>
        <value caption="1:2^32(38.5 hours)" name="DSPS32" value="0x1b"/>
        <value caption="1:2^33(77.0 hours)" name="DSPS33" value="0x1c"/>
        <value caption="1:2^34(6.4 days)" name="DSPS34" value="0x1d"/>
        <value caption="1:2^35(12.8 days)" name="DSPS35" value="0x1e"/>
        <value caption="1:2^36(25.7 days)" name="DSPS36" value="0x1f"/>
      </value-group>
      <value-group caption="Deep Sleep WDT Reference Clock Selection" name="DEVCFG4__DSWDTOSC">
        <value caption="Select SOSC as DSWDT Reference Clock" name="SOSC" value="0x0"/>
        <value caption="Select LPRC as DSWDT Reference Clock" name="LPRC" value="0x1"/>
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Enable" name="DEVCFG4__DSWDTEN">
        <value caption="Enabled" name="ON" value="0x1"/>
        <value caption="Disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Deep Sleep Zero-Power BOR Enable bit" name="DEVCFG4__DSZPBOREN">
        <value caption="Enabled" name="ON" value="0x1"/>
        <value caption="Disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Deep Sleep Bit Enable" name="DEVCFG4__DSEN">
        <value caption="Enable DS Bit in DSCON" name="ON" value="0x1"/>
        <value caption="Disable DS Bit in DSCON" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="RTC Counter Mode Clock Select" name="DEVCFG4__RTCNTM_CSEL">
        <value caption="Raw 32kHz clock" name="RAW" value="0x1"/>
        <value caption="Processed 32kHz clock" name="PROCESSED" value="0x0"/>
      </value-group>
      <value-group caption="Low Power Osc (Secondary) Enable bit" name="DEVCFG4__LPOSCEN">
        <value caption="Enabled" name="ON" value="0x1"/>
        <value caption="Disable" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="ULPVREG Retention Mode Override" name="DEVCFG4__UVREGROVR">
        <value caption="ULPVREG forced in retention mode" name="FORCED" value="0x1"/>
        <value caption="ULPVREG controlled by XDS/DS FSM" name="CONTROLLED" value="0x0"/>
      </value-group>
      <value-group caption="Charge-pump Ready Digital Delay" name="DEVCFG4__CPEN_DLY">
        <value caption="1 LPRC Clock Cycle Delay" name="_1_LPRC" value="0x0"/>
        <value caption="2 LPRC Clock Cycle Delay" name="_2_LPRC" value="0x1"/>
        <value caption="3 LPRC Clock Cycle Delay" name="_3_LPRC" value="0x2"/>
        <value caption="4 LPRC Clock Cycle Delay" name="_4_LPRC" value="0x3"/>
        <value caption="5 LPRC Clock Cycle Delay" name="_5_LPRC" value="0x4"/>
        <value caption="6 LPRC Clock Cycle Delay" name="_6_LPRC" value="0x5"/>
        <value caption="7 LPRC Clock Cycle Delay" name="_7_LPRC" value="0x6"/>
        <value caption="8 LPRC Clock Cycle Delay" name="_8_LPRC" value="0x7"/>
      </value-group>
      <value-group caption="RTC Event Type" name="DEVCFG4__RTCEVTYPE">
        <value caption="RTC_EVENT" name="EVENT" value="0x1"/>
        <value caption="RTC_OUT" name="OUT" value="0x0"/>
      </value-group>
      <value-group caption="LPCLK Modifier in counter/delay mode" name="DEVCFG4__LPCLK_MOD">
        <value caption="Divide-by 1 (Recommended when LPCLK=32kHz)" name="DIV_1" value="0x0"/>
        <value caption="Divide-by 1.024 (Recommended when LPCLK=32.768kHz)" name="DIV_1_024" value="0x1"/>
      </value-group>
      <value-group caption="VDDBUKPCORE LPCLK Clock Divider Selection" name="DEVCFG4__VBKP_DIVSEL">
        <value caption="Divide by 31.25 (Recommended when LPCLK=32kHz)" name="DIV_31_25" value="0x1"/>
        <value caption="Divide-by 32 (Recommended when LPCLK=32.768kHz))" name="DIV_32" value="0x0"/>
      </value-group>
